#pragma once
//=====================================================================//
/*!	@file
	@brief	Audio ファイル Play
    @author 平松邦仁 (hira@rvf-rc45.net)
	@copyright	Copyright (C) 2018 Kunihito Hiramatsu @n
				Released under the MIT license @n
				https://github.com/hirakuni45/RX/blob/master/LICENSE
*/
//=====================================================================//
#include <cstdint>
#include <functional>
#include "common/file_io.hpp"

namespace sound {

	//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++//
	/*!
		@brief	Audio File Play クラス
	*/
	//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++//
	class af_play {
	public:

		//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++//
		/*!
			@brief	制御列挙型
		*/
		//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++//
		enum class CTRL {
			NONE,		///< 何もしない
			STOP,		///< 停止
			PAUSE,		///< 一時停止
			REPLAY,		///< 曲の先頭に戻って再生
		};


		//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++//
		/*!
			@brief	制御タスク型
		*/
		//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++//
		typedef std::function<CTRL ()> CTRL_TASK;


		//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++//
		/*!
			@brief	情報タスク型
		*/
		//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++//
		typedef std::function<void (utils::file_io& fin, const tag_t&)> TAG_TASK;


		//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++//
		/*!
			@brief	更新タスク型
		*/
		//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++//
		typedef std::function<void (uint32_t)> UPDATE_TASK;

			CTRL_TASK	ctrl_task_;
			TAG_TASK	tag_task_;
			UPDATE_TASK	update_task_;


		//-----------------------------------------------------------------//
		/*!
			@brief	コンストラクター
		*/
		//-----------------------------------------------------------------//
		af_play() noexcept : ctrl_task_(), tag_task_(), update_task_() { }


		//-----------------------------------------------------------------//
		/*!
			@brief	制御タスクの設定
			@param[in]	task	制御タスク
		*/
		//-----------------------------------------------------------------//
		void set_ctrl_task(CTRL_TASK task) noexcept
		{
			ctrl_task_ = task;
		}


		//-----------------------------------------------------------------//
		/*!
			@brief	タグ・タスクの設定
			@param[in]	task	タグ・タスク
		*/
		//-----------------------------------------------------------------//
		void set_tag_task(TAG_TASK task) noexcept
		{
			tag_task_ = task;
		}


		//-----------------------------------------------------------------//
		/*!
			@brief	アップデート・タスクの設定
			@param[in]	task	アップデート・タスク
		*/
		//-----------------------------------------------------------------//
		void set_update_task(UPDATE_TASK task) noexcept
		{
			update_task_ = task;
		}
	};
}
