#pragma once
//=====================================================================//
/*!	@file
	@brief	Audio タグ・クラス
    @author 平松邦仁 (hira@rvf-rc45.net)
	@copyright	Copyright (C) 2018 Kunihito Hiramatsu @n
				Released under the MIT license @n
				https://github.com/hirakuni45/RX/blob/master/LICENSE
*/
//=====================================================================//
#include "common/fixed_string.hpp"

namespace sound {

	//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++//
	/*!
		@brief	タグ情報
	*/
	//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++//
	struct tag_t {
		typedef utils::fixed_string<128> STR128;
		typedef utils::fixed_string<16> STR16;
		typedef utils::fixed_string<8> STR8;

		STR128	album_;		///< アルバム名
		STR128	title_;		///< タイトル（曲名）
		STR128	artist_;	///< アーティスト
		STR16	year_;		///< リリース年
		STR8	disc_;		///< ディスク
		STR8	track_;		///< トラック


		//-------------------------------------------------------------//
		/*!
			@brief	コンストラクター
		*/
		//-------------------------------------------------------------//
		tag_t() noexcept { clear(); }


		//-------------------------------------------------------------//
		/*!
			@brief	クリア
		*/
		//-------------------------------------------------------------//
		void clear() noexcept
		{
			album_.clear();
			title_.clear();
			artist_.clear();
			year_.clear();
			disc_.clear();
			track_.clear();
		}


		//-------------------------------------------------------------//
		/*!
			@brief	アルバムへの参照
			@return アルバム
		*/
		//-------------------------------------------------------------//
		STR128& at_album() noexcept { return album_; }


		//-------------------------------------------------------------//
		/*!
			@brief	タイトルへの参照
			@return タイトル
		*/
		//-------------------------------------------------------------//
		STR128& at_title() noexcept { return title_; }


		//-------------------------------------------------------------//
		/*!
			@brief	アーティストへの参照
			@return アーティスト
		*/
		//-------------------------------------------------------------//
		STR128& at_artist() noexcept { return artist_; }


		//-------------------------------------------------------------//
		/*!
			@brief	年への参照
			@return 年
		*/
		//-------------------------------------------------------------//
		STR16& at_ayear() noexcept { return year_; }


		//-------------------------------------------------------------//
		/*!
			@brief	ディスクへの参照
			@return ディスク
		*/
		//-------------------------------------------------------------//
		STR8& at_disc() noexcept { return disc_; }


		//-------------------------------------------------------------//
		/*!
			@brief	トラックへの参照
			@return トラック
		*/
		//-------------------------------------------------------------//
		STR8& at_track() noexcept { return track_; }
	};
}
