#pragma once
//=====================================================================//
/*!	@file
	@brief	Audio タグ・クラス
    @author 平松邦仁 (hira@rvf-rc45.net)
	@copyright	Copyright (C) 2018 Kunihito Hiramatsu @n
				Released under the MIT license @n
				https://github.com/hirakuni45/RX/blob/master/LICENSE
*/
//=====================================================================//
#include <cstdint>

namespace audio {

	//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++//
	/*!
		@brief	タグ情報
	*/
	//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++//
	struct tag_t {
		char		album_[64];		///< アルバム名
		char		title_[64];		///< タイトル（曲名）
		char		artist_[64];	///< アーティスト
		char		year_[16];		///< リリース年
		char		track_[8];		///< トラック

		//-------------------------------------------------------------//
		/*!
			@brief	コンストラクター
		*/
		//-------------------------------------------------------------//
		tag_t() noexcept { clear(); }


		//-------------------------------------------------------------//
		/*!
			@brief	クリア
		*/
		//-------------------------------------------------------------//
		void clear() noexcept
		{
			album_[0] = 0;
			title_[0] = 0;
			artist_[0] = 0;
			year_[0] = 0;
			track_[0] = 0;
		}
	};
}
