#pragma once
//=====================================================================//
/*!	@file
	@brief	Audio タグ・クラス
    @author 平松邦仁 (hira@rvf-rc45.net)
	@copyright	Copyright (C) 2018, 2019 Kunihito Hiramatsu @n
				Released under the MIT license @n
				https://github.com/hirakuni45/RX/blob/master/LICENSE
*/
//=====================================================================//
#include "common/fixed_string.hpp"

namespace sound {

	//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++//
	/*!
		@brief	音楽・タグ情報
	*/
	//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++//
	struct tag_t {
		typedef utils::fixed_string<128> STR128;
		typedef utils::fixed_string<8> STR8;

	private:
		STR128	album_;		///< アルバム名
		STR128	title_;		///< タイトル（曲名）
		STR128	artist_;	///< 1st アーティスト
		STR128	artist2_;	///< 2nd アーティスト
		STR8	year_;		///< リリース年
		STR8	date_;		///< リリース日付
		STR8	disc_;		///< ディスク番号
		STR8	track_;		///< トラック番号
		STR128	comment_;	///< コメント

	public:
		//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++//
		/*!
			@brief	画像情報
		*/
		//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++//
		struct apic_t {
			uint8_t		typ_;
			char		ext_[4];
			uint32_t	ofs_;
			uint32_t	len_;
			apic_t() : typ_(0), ext_{ 0 }, ofs_(0), len_(0) { }
			apic_t& operator = (const apic_t& t) noexcept {
				typ_ = t.typ_;
				std::memcpy(ext_, t.ext_, sizeof(ext_));
				ofs_ = t.ofs_;
				len_ = t.len_;
				return *this;
			}
		};
	private:
		apic_t	apic_;

	public:
		//-------------------------------------------------------------//
		/*!
			@brief	コンストラクター
		*/
		//-------------------------------------------------------------//
		tag_t() noexcept : apic_() { clear(); }


		//-------------------------------------------------------------//
		/*!
			@brief	クリア
		*/
		//-------------------------------------------------------------//
		void clear() noexcept
		{
			album_.clear();
			title_.clear();
			artist_.clear();
			artist2_.clear();
			year_.clear();
			date_.clear();
			disc_.clear();
			track_.clear();
			comment_.clear();
			apic_ = apic_t();
		}


		//-------------------------------------------------------------//
		/*!
			@brief	アルバムへの参照
			@return アルバム
		*/
		//-------------------------------------------------------------//
		auto& at_album() noexcept { return album_; }


		//-------------------------------------------------------------//
		/*!
			@brief	アルバムへの参照 (RO)
			@return アルバム
		*/
		//-------------------------------------------------------------//
		const auto& get_album() const noexcept { return album_; }


		//-------------------------------------------------------------//
		/*!
			@brief	タイトルへの参照
			@return タイトル
		*/
		//-------------------------------------------------------------//
		auto& at_title() noexcept { return title_; }


		//-------------------------------------------------------------//
		/*!
			@brief	タイトルへの参照 (RO)
			@return タイトル
		*/
		//-------------------------------------------------------------//
		const auto& get_title() const noexcept { return title_; }


		//-------------------------------------------------------------//
		/*!
			@brief	1st アーティストへの参照
			@return 1st アーティスト
		*/
		//-------------------------------------------------------------//
		auto& at_artist() noexcept { return artist_; }


		//-------------------------------------------------------------//
		/*!
			@brief	1st アーティストへの参照 (RO)
			@return 1st アーティスト
		*/
		//-------------------------------------------------------------//
		const auto& get_artist() const noexcept { return artist_; }


		//-------------------------------------------------------------//
		/*!
			@brief	2nd アーティストへの参照
			@return 2nd アーティスト
		*/
		//-------------------------------------------------------------//
		auto& at_artist2() noexcept { return artist2_; }


		//-------------------------------------------------------------//
		/*!
			@brief	2nd アーティストへの参照 (RO)
			@return 2nd アーティスト
		*/
		//-------------------------------------------------------------//
		const auto& get_artist2() const noexcept { return artist2_; }


		//-------------------------------------------------------------//
		/*!
			@brief	年への参照
			@return 年
		*/
		//-------------------------------------------------------------//
		auto& at_year() noexcept { return year_; }


		//-------------------------------------------------------------//
		/*!
			@brief	年への参照 (RO)
			@return 年
		*/
		//-------------------------------------------------------------//
		const auto& get_year() const noexcept { return year_; }


		//-------------------------------------------------------------//
		/*!
			@brief	日付への参照
			@return 日付
		*/
		//-------------------------------------------------------------//
		auto& at_date() noexcept { return date_; }


		//-------------------------------------------------------------//
		/*!
			@brief	日付への参照 (RO)
			@return 日付
		*/
		//-------------------------------------------------------------//
		const auto& get_date() const noexcept { return date_; }


		//-------------------------------------------------------------//
		/*!
			@brief	ディスクへの参照
			@return ディスク
		*/
		//-------------------------------------------------------------//
		auto& at_disc() noexcept { return disc_; }


		//-------------------------------------------------------------//
		/*!
			@brief	ディスクへの参照 (RO)
			@return ディスク
		*/
		//-------------------------------------------------------------//
		const auto& get_disc() const noexcept { return disc_; }


		//-------------------------------------------------------------//
		/*!
			@brief	トラックへの参照
			@return トラック
		*/
		//-------------------------------------------------------------//
		auto& at_track() noexcept { return track_; }


		//-------------------------------------------------------------//
		/*!
			@brief	トラックへの参照 (RO)
			@return トラック
		*/
		//-------------------------------------------------------------//
		const auto& get_track() const noexcept { return track_; }


		//-------------------------------------------------------------//
		/*!
			@brief	コメントへの参照
			@return コメント
		*/
		//-------------------------------------------------------------//
		auto& at_comment() noexcept { return comment_; }


		//-------------------------------------------------------------//
		/*!
			@brief	コメントへの参照 (RO)
			@return コメント
		*/
		//-------------------------------------------------------------//
		const auto& get_comment() const noexcept { return comment_; }


		//-------------------------------------------------------------//
		/*!
			@brief	アルバム画像情報への参照
			@return アルバム画像情報
		*/
		//-------------------------------------------------------------//
		auto& at_apic() noexcept { return apic_; }


		//-------------------------------------------------------------//
		/*!
			@brief	アルバム画像情報への参照 (RO)
			@return アルバム画像情報
		*/
		//-------------------------------------------------------------//
		const auto& get_apic() const noexcept { return apic_; }


		//-------------------------------------------------------------//
		/*!
			@brief	コピー・オペレーター
		*/
		//-------------------------------------------------------------//
		tag_t& operator = (const tag_t& ths) noexcept {
			album_  = ths.album_;
			title_  = ths.title_;
			artist_ = ths.artist_;
			artist2_ = ths.artist2_;
			year_   = ths.year_;
			disc_   = ths.disc_;
			track_  = ths.track_;
			apic_   = ths.apic_;
			return *this;
		}
	};
}
