#pragma once
//=====================================================================//
/*!	@file
	@brief	RX63T グループ・ペリフェラル @n
			Copyright 2016 Kunihito Hiramatsu
	@author	平松邦仁 (hira@rvf-rc45.net)
*/
//=====================================================================//
#include <cstdint>

namespace device {

	//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++//
	/*!
		@brief  ペリフェラル種別
	*/
	//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++//
	enum class peripheral {
		SCI0,
		SCI1,
		SCI2,
		SCI3,

		CMT0,
		CMT1,
		CMT2,
		CMT3,
	};
}
