#pragma once
//=====================================================================//
/*!	@file
	@brief	delay
	@author	平松邦仁 (hira@rvf-rc45.net)
*/
//=====================================================================//
#include <cstdint>

namespace utils {

	//-----------------------------------------------------------------//
	/*!
		@brief	無駄ループによる時間待ち
		@param[in]	n	無駄ループ回数
	 */
	//-----------------------------------------------------------------//
	inline void wait_delay(uint32_t n) {
		static volatile uint8_t dummy_;
		// とりあえず無駄ループ
		for(uint32_t i = 0; i < n; ++i) {
			dummy_ += i & 255;
		}
	}
}
