#pragma once
//=====================================================================//
/*!	@file
	@brief	固定サイズ・メモリー・クラス
    @author 平松邦仁 (hira@rvf-rc45.net)
	@copyright	Copyright (C) 2017 Kunihito Hiramatsu @n
				Released under the MIT license @n
				https://github.com/hirakuni45/RX/blob/master/LICENSE
*/
//=====================================================================//

namespace utils {

	//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++//
	/*!
		@brief  固定サイズ・メモリー・クラス
		@param[in]	SIZE	格納サイズ（バイト）
		@param[in]	DNUM	分割最大数
	*/
	//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++//
	template <uint32_t SIZE, uint32_t DNUM>
	class fixed_memory {

		uint8_t	buff_[SIZE];

		struct head {
			uint16_t	pos_;
			uint16_t	size_;
		};

		head	head_[DNUM];

	public:
		//-----------------------------------------------------------------//
		/*!
			@brief  コンストラクタ
		*/
		//-----------------------------------------------------------------//
		fixed_memory() noexcept { }


		//-----------------------------------------------------------------//
		/*!
			@brief  最大サイズを返す
			@return 最大サイズ
		*/
		//-----------------------------------------------------------------//
		uint32_t capacity() const noexcept { return SIZE; }


		//-----------------------------------------------------------------//
		/*!
			@brief  メモリー・アロケーション
			@param[in]	size	アロケーション・サイズ
			@return メモリー・ポインター
		*/
		//-----------------------------------------------------------------//
		void* alloc(uint16_t size)
		{
			uint8_t* ptr = nullptr;

			return ptr;
		}


		//-----------------------------------------------------------------//
		/*!
			@brief  最大サイズを返す
			@return 最大サイズ
		*/
		//-----------------------------------------------------------------//
		void free(void* ptr)
		{

		}
	};
}
