#pragma once
//=====================================================================//
/*!	@file
	@brief	Flash memory マネージャー @n
			Copyright 2017 Kunihito Hiramatsu
	@author	平松邦仁 (hira@rvf-rc45.net)
*/
//=====================================================================//
#include "common/renesas.hpp"

namespace utils {

	//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++//
	/*!
		@brief  flash_man class
		@param[in]	IO	フラッシュ I/O
	*/
	//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++//
	template <class IO>
	class flash_man {

		IO&		io_;


	public:
		//-----------------------------------------------------------------//
		/*!
			@brief  コンストラクタ
		*/
		//-----------------------------------------------------------------//
		flash_man(IO& io) : io_(io) { }


	};
}
