#pragma once
//=====================================================================//
/*!	@file
	@brief	割り込み・ユーティリティー
    @author 平松邦仁 (hira@rvf-rc45.net)
	@copyright	Copyright (C) 2017 Kunihito Hiramatsu @n
				Released under the MIT license @n
				https://github.com/hirakuni45/R8C/blob/master/LICENSE
*/
//=====================================================================//
#include <cstdint>

namespace utils {

	//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++//
	/*!
		@brief  null タスク
	*/
	//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++//
	class null_task {
	public:

		//-----------------------------------------------------------------//
		/*!
			@brief  何もしない
		*/
		//-----------------------------------------------------------------//
		void operator () () {
		}
	};

}

