#pragma once
//=====================================================================//
/*!	@file
	@brief	RX600 グループ・SSI I/O 制御
    @author 平松邦仁 (hira@rvf-rc45.net)
	@copyright	Copyright (C) 2018 Kunihito Hiramatsu @n
				Released under the MIT license @n
				https://github.com/hirakuni45/RX/blob/master/LICENSE
*/
//=====================================================================//
#include "RX600/ssi.hpp"

namespace utils {

	//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++//
	/*!
		@brief  SSI（シリアルサウンドインターフェース）制御クラス
		@param[in]	SSI	ハードウェアーリソース
	*/
	//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++//
	template <class SSI>
	class ssi_io {


	public:
		//-----------------------------------------------------------------//
		/*!
			@brief  コンストラクター
		*/
		//-----------------------------------------------------------------//
		ssi_io() { }


		//-----------------------------------------------------------------//
		/*!
			@brief  開始
			@param[in]	sr	サンプル・レート
		*/
		//-----------------------------------------------------------------//
		bool start(uint32_t sr)
		{

			return true;
		}
	};
}

