#pragma once
//=========================================================================//
/*! @file
    @brief  MAC Cash @n
			Copyright 2017 Kunihito Hiramatsu
    @author 平松邦仁 (hira@rvf-rc45.net)
*/
//=========================================================================//


namespace net {

	//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++//
	/*!
		@brief  mac_cash クラス
		@param[in]	MAXN	キャッシュの最大数
	*/
	//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++//
	template<uint32_t ARPN>
	class mac_cash {





	};
}

