#pragma once
//=========================================================================//
/*! @file
    @brief  UDP Protocol @n
			Copyright 2017 Kunihito Hiramatsu
    @author 平松邦仁 (hira@rvf-rc45.net)
*/
//=========================================================================//
#include "net2/net_st.hpp"
#include "net2/mac_cash.hpp"

namespace net {

	//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++//
	/*!
		@brief  UDP クラス
	*/
	//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++//
	class udp {

		ip_adrs		adrs_;
		uint16_t	src_port_;
		uint16_t	dst_port_;

		bool		open_;

	public:
		//-----------------------------------------------------------------//
		/*!
			@brief  コンストラクター
		*/
		//-----------------------------------------------------------------//
		udp() : adrs_(), src_port_(0), dst_port_(0), open_(false) { }


		//-----------------------------------------------------------------//
		/*!
			@brief  「空」か検査
			@return 「空」なら「true」
		*/
		//-----------------------------------------------------------------//
		bool empty() const { return !open_; }


		//-----------------------------------------------------------------//
		/*!
			@brief	転送元ポート番号を返す
			@return 転送元ポート番号
		*/
		//-----------------------------------------------------------------//
		uint16_t get_src_port() const noexcept { return src_port_; }


		//-----------------------------------------------------------------//
		/*!
			@brief	転送先ポート番号を返す
			@return 転送先ポート番号
		*/
		//-----------------------------------------------------------------//
		uint16_t get_dst_port() const noexcept { return dst_port_; }


		//-----------------------------------------------------------------//
		/*!
			@brief  オープン
			@param[in]	adrs	アドレス
			@param[in]	sport	転送元ポート
			@param[in]	dport	転送先ポート
			@return 成功なら「true」
		*/
		//-----------------------------------------------------------------//
		bool open(const ip_adrs& adrs, uint16_t sport, uint16_t dport)
		{
			if(open_) {  // 既に使われている
				return false;
			}
			adrs_ = adrs;
			src_port_ = sport;
			dst_port_ = dport;
			return true;
		}


		//-----------------------------------------------------------------//
		/*!
			@brief  クローズ
		*/
		//-----------------------------------------------------------------//
		void close()
		{
			open_ = false;
		}
	};
}
