#pragma once
//=====================================================================//
/*! @file
    @brief  グラフ 関数電卓・クラス @n
			calc_graph
    @author 平松邦仁 (hira@rvf-rc45.net)
	@copyright	Copyright (C) 2021 Kunihito Hiramatsu @n
				Released under the MIT license @n
				https://github.com/hirakuni45/RX/blob/master/LICENSE
*/
//=====================================================================//

namespace app {

    //+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++//
    /*!
        @brief  CALC Graph クラス
    */
    //+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++//
    class calc_graph {

	public:
		//-------------------------------------------------------------//
		/*!
			@brief  graph コンストラクタ
		*/
		//-------------------------------------------------------------//
		calc_graph() noexcept
        { }


		//-------------------------------------------------------------//
		/*!
			@brief  開始
		*/
		//-------------------------------------------------------------//
        void start() noexcept
        {
        }
    };
}
